Modules/Property/Services/PropertyStorage.php

insert into `properties` (`name`, `description`, `unit`, `is_hidden_from_product`, `is_hidden_from_comparison`, `is_numeric`, `is_boolean`, `key`, `updated_at`, `created_at`) values ('testdafad', '<p>dfadfadf</p>', '', 0, 0, 0, 0, 'testdafad', '2022-08-09 14:21:49', '2022-08-09 14:21:49')
---
    public function store(PropertyDto $propertyDto)
    {
        $attributes = $propertyDto->toArray();

        $attributes['assigned_by_id'] = $propertyDto->assigned_by_id ?? auth('custom-token')->id();

        $property = new Property($attributes);

        if (!$property->save()) {

update `properties` set `name` = 'Оборудование для борьбы с последствиями COVID-19 test', `description` = '', `properties`.`updated_at` = '2022-08-09 14:21:14' where `id` = 26
---
    public function update(Property $property, PropertyDto $propertyDto)
    {
        $attributes = $propertyDto->toArray();

        $attributes['assigned_by_id'] = $propertyDto->assigned_by_id ?? null;

        if (!$property->update($attributes)) {