Modules/Category/Services/CategoryStorage.php

update `categories` set `deleted_at` = '2022-08-09 13:46:03', `categories`.`updated_at` = '2022-08-09 13:46:03' where `id` = 52
---
    public function delete(Category $category)
    {
        if (!$category->delete()) {