Modules/Product/Models/Product.php

    public function productReviews(): HasMany
    {
        return $this->hasMany(ProductReview::class)
            ->where('status', ProductReviewStatus::APPROVED);
---
select * from `product_reviews` where `product_reviews`.`product_id` = 100 and `product_reviews`.`product_id` is not null and `status` = 2